app/controllers/api/v1/creators_controller.rb

  def index
    @creators = Creator.all

    #initialize variable before loop
    creators_array = []

    @creators.each do |creator|
---
SELECT "creators".* FROM "creators"

  def show
    @creator = Creator.find(params[:id])
---
SELECT "creators".* FROM "creators" WHERE "creators"."id" = 1 LIMIT 1