app/controllers/api/v1/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = Product.all

    #initialize variable before loop
    products_array = []

    @products.each do |product|