app/controllers/api/v1/promotions_controller.rb

  def index
    @promotions = Promotion.all

    #initialize variable before loop
    promotions_array = []

    @promotions.each do |promotion|
---
SELECT "promotions".* FROM "promotions"

  def show
    @promotion = Promotion.find(params[:id])
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = 1 LIMIT 1