app/views/product/index.html.erb

   <ul>
      <% if product.promotions.any? %>
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."product_id" IN (1, 2)