app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = 1 LIMIT 1
INSERT INTO "carts" ("user_id", "cart_item_id", "created_at", "updated_at") VALUES (5, NULL, '2025-10-15 23:20:31.189726', '2025-10-15 23:20:31.189726') RETURNING "id"
---
  def set_cart
    if current_user.cart.present?
      @cart = current_user.cart
    else
      @cart = current_user.create_cart