app/controllers/cart_items_controller.rb

INSERT INTO "cart_items" ("product_id", "created_at", "updated_at", "cart_id") VALUES (1, '2025-10-07 02:34:01.262535', '2025-10-07 02:34:01.262535', 2) RETURNING "id"
---
  def create
    debugger
    @cart_item = @cart.cart_items.build(cart_items_params)

     respond_to do |format|
          if @cart_item.save

DELETE FROM "cart_items" WHERE "cart_items"."id" = 6
---
  def destroy
    @cart_item.destroy!

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = 3 LIMIT 1
---
  def set_cart
    if current_user.cart.present?

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 2 AND "cart_items"."id" = 6 LIMIT 1
---
  def set_cart_items
    @cart_items = @cart.cart_items.all

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 2 AND "cart_items"."id" = 2 LIMIT 1
---
  def set_cart_item
    @cart_item = @cart.cart_items.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
---
  def set_product
    @product = Product.find(params[:product_id])