app/controllers/creators_controller.rb

  def index
    @creators = Creator.all
---
SELECT "creators".* FROM "creators"

  def show
    @creator = Creator.find(params[:id])
---
SELECT "creators".* FROM "creators" WHERE "creators"."id" = 1 LIMIT 1

  def create
      @creator = Creator.new(creator_params)

      respond_to do |format|
          if @creator.save
---
INSERT INTO "creators" ("first_name", "last_name", "created_at", "updated_at") VALUES ('Test', 'Test', '2025-10-17 16:46:45.481911', '2025-10-17 16:46:45.481911') RETURNING "id"

  def update
    respond_to do |format|
        #check if first name blank
        if params[:first_name].blank?
            format.html {render :edit, status: :bad_request}
            format.json {render json: @creator.errors, status: :bad_request}
        end

        if @creator.update(creator_params)
---
UPDATE "creators" SET "last_name" = 'Artist', "updated_at" = '2025-10-17 16:47:02.069542' WHERE "creators"."id" = 3

  def destroy
    @creator.destroy
---
DELETE FROM "creators" WHERE "creators"."id" = 3

  def set_creator
    @creator = Creator.find(params[:id])
---
SELECT "creators".* FROM "creators" WHERE "creators"."id" = 3 LIMIT 1