app/controllers/creator_controller.rb

  def index
    @creators = Creator.all
---
SELECT "creators".* FROM "creators"

  def show
    @creator = Creator.find(params[:id])
---
SELECT "creators".* FROM "creators" WHERE "creators"."id" = 1 LIMIT 1