app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "updated_at", "title", "promotion_id", "product_type_id", "creator_id", "description", "price", "available", "medium") VALUES ('2025-10-17 18:32:48.939041', '2025-10-17 18:32:48.939041', 'Test', 1, NULL, 1, 'Test', 0.9, 1, NULL) RETURNING "id"
---
  def create
      @product = Product.new(product_params)

      respond_to do |format|
          if @product.save

UPDATE "products" SET "updated_at" = '2025-10-17 18:35:28.845996', "promotion_id" = 1, "available" = 1 WHERE "products"."id" = 9
---
  def update
    respond_to do |format|
        if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = 10
---
  def destroy
    @product.destroy!