app/controllers/product_controller.rb

SELECT "products".* FROM "products"
SELECT "promotions".* FROM "promotions" WHERE "promotions"."product_id" IN (1, 2)
---
  def index
    @products = Product.includes(:promotions, :product_type).all