app/controllers/promotions_controller.rb

  def index
    @promotions = Promotion.all
---
SELECT "promotions".* FROM "promotions"

  def show
    @promotion = Promotion.find(params[:id])
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = 2 LIMIT 1

  def create
      @promotion = Promotion.new(promotion_params)

      respond_to do |format|
          if @promotion.save
---
INSERT INTO "promotions" ("promotion_description", "discount_percent", "created_at", "updated_at", "product_id") VALUES ('Muri', 100.0, '2025-09-16 00:22:27.014780', '2025-09-16 00:22:27.014780', 2) RETURNING "id"

  def update
    respond_to do |format|
         #check if description blank
        #if params[:promotion_description].blank?
        #  format.html {render :edit, status: :bad_request}
        #  format.json {render json: @promotion.errors, status: :bad_request}
        #end

        #if params[:discount_percent].blank?
        #  format.html {render :edit, status: :bad_request}
        #  format.json {render json: @promotion.errors, status: :bad_request}
        #end

        if @promotion.update(promotion_params)
---
UPDATE "promotions" SET "promotion_description" = 'Half Off', "discount_percent" = 50.0, "updated_at" = '2025-09-16 00:17:24.551062' WHERE "promotions"."id" = 1

  def destroy
    @promotion.destroy
---
DELETE FROM "promotions" WHERE "promotions"."id" = 3

  def set_promotion
    @promotion = Promotion.find(params[:id])
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = 2 LIMIT 1