app/controllers/promotion_controller.rb

  def index
    @promotions = Promotion.all
---
SELECT "promotions".* FROM "promotions"

  def show
    @promotion = Promotion.find(params[:id])
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = 1 LIMIT 1