app/controllers/users_controller.rb

  def create
      @user = User.new(user_params)
      @user.create_cart

      respond_to do |format|
          if @user.save
---
INSERT INTO "carts" ("user_id", "cart_item_id", "created_at", "updated_at") VALUES (9, NULL, '2025-10-21 17:39:22.863510', '2025-10-21 17:39:22.863510') RETURNING "id"
INSERT INTO "users" ("username", "cart_id", "email", "first_name", "string", "last_name", "address", "zipcode", "state", "sex", "birthday", "created_at", "updated_at", "role", "password_digest") VALUES ('TestUser3', NULL, 'test', 'Test', NULL, 'Testing', 'test', '00000', 'CO', 'None', 'Test Birthday', '2025-10-21 17:39:22.844091', '2025-10-21 17:39:22.844091', 'basic user', '$2a$12$yF.MGxOrkyAGTpZ75tZt.Oyasb6ohEPLmLmB/pgWI2NyQBuBk/.eW') RETURNING "id"
INSERT INTO "carts" ("user_id", "cart_item_id", "created_at", "updated_at") VALUES (6, NULL, '2025-10-17 19:09:20.360942', '2025-10-17 19:09:20.360942') RETURNING "id"
INSERT INTO "users" ("username", "cart_id", "email", "first_name", "string", "last_name", "address", "zipcode", "state", "sex", "birthday", "created_at", "updated_at", "role", "password_digest") VALUES ('test', NULL, 'test', 'test', NULL, 'test', 'test', '0', 'test', 'test', 'test', '2025-10-15 23:19:44.728782', '2025-10-15 23:19:44.728782', 'basic user', '$2a$12$U2rzSNPwNud5BKbck.OtBeQKV1N.ZvUHoUeP0bsrh5WWMRRFKIg8C') RETURNING "id"

  def update
    respond_to do |format|
         #check if description blank
        if params[:username].blank?
          format.html {render :edit, status: :bad_request}
          format.json {render json: @user.errors, status: :bad_request}
        end

        if params[:password].blank?
          format.html {render :edit, status: :bad_request}
          format.json {render json: @user.errors, status: :bad_request}
        end

        if @user.update(user_params)
---
UPDATE "users" SET "email" = 'updatedemail@email.com', "updated_at" = '2025-10-15 23:07:27.063297', "password_digest" = '$2a$12$hCg2pibGxMZHffdP5F.Qo.4zliEPihb/SW1LwS4tUm20ukg7Y5be2' WHERE "users"."id" = 1