app/views/products/_form.html.erb

    <%= form.label :creator_id, style: "display: block" %>
    <%= form.collection_select :creator_id, Creator.all, :id, :full_name %>
---
SELECT "creators".* FROM "creators"

    <%= form.label :promotion_id, style: "display: block" %>
     <%= form.collection_select :promotion_id, Promotion.all, :id, :promotion_description, include_blank: 'None' %>
---
SELECT "promotions".* FROM "promotions"