app/views/products/_product.html.erb

    <h2>Available: <%= @product.available %></h2>
    <% if product.promotion.present? %>
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = 1 LIMIT 1