app/views/products/index.html.erb

SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = 1 LIMIT 1
---
   <ul>
      <% if product.promotion.present? %>