app/views/layouts/application.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
              <li class='nav-item'>
                <% user = User.find_by(id: session[:user_id]) %>

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
            <li class='nav-item'>
              <% user = User.find_by(id: session[:user_id]) %>